Revit 2027 API
ElementClassFilter.GetElementClass Method
 The class for the filter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Type GetElementClass()
Public Function GetElementClass As Type
public:
Type^ GetElementClass()
member GetElementClass : unit -> Type
Return Value
Type
 The class.
See Also
Reference
ElementClassFilter Class
Autodesk.Revit.DB Namespace